hoangvangioi/freertos_stm32f103c8t6/FreeRTOS/include/FreeRTOSConfig.h
#ifndef FREERTOS_CONFIG_H
#define FREERTOS_CONFIG_H

#include "stm32f10x.h"

#define configUSE_PREEMPTION	 1
#define configUSE_IDLE_HOOK		 0
#define configUSE_TICK_HOOK		 0
#define configCPU_CLOCK_HZ		 ((unsigned long)72000000)
#define configTICK_RATE_HZ		 ((TickType_t)1000)
#define configMAX_PRIORITIES	 (5)
#define configMINIMAL_STACK_SIZE ((unsigned short)120)
#define configTOTAL_HEAP_SIZE	 ((size_t)(18 * 1024))
#define configMAX_TASK_NAME_LEN	 (16)
#define configUSE_TRACE_FACILITY 1
#define configUSE_16_BIT_TICKS	 0
#define configIDLE_SHOULD_YIELD	 1

/* Co-routine definitions. */
#define configUSE_CO_ROUTINES			0
#define configMAX_CO_ROUTINE_PRIORITIES (2)

#define configUSE_MUTEXES				1
#define configUSE_COUNTING_SEMAPHORES	1
#define configUSE_ALTERNATIVE_API		0
#define configCHECK_FOR_STACK_OVERFLOW	0
#define configUSE_RECURSIVE_MUTEXES		1
#define configQUEUE_REGISTRY_SIZE		0
#define configGENERATE_RUN_TIME_STATS	0

/* Software timer definitions. */
#define configUSE_TIMERS			 1
#define configTIMER_TASK_PRIORITY	 (configMAX_PRIORITIES - 1)
#define configTIMER_QUEUE_LENGTH	 5
#define configTIMER_TASK_STACK_DEPTH configMINIMAL_STACK_SIZE

/* Set the following definitions to 1 to include the API function, or zero
to exclude the API function. */

#define INCLUDE_vTaskPrioritySet	  1
#define INCLUDE_uxTaskPriorityGet	  1
#define INCLUDE_vTaskDelete			  1
#define INCLUDE_vTaskCleanUpResources 0
#define INCLUDE_vTaskSuspend		  1
#define INCLUDE_vTaskDelayUntil		  1
#define INCLUDE_vTaskDelay			  1

#ifdef __NVIC_PRIO_BITS
#define configPRIO_BITS __NVIC_PRIO_BITS
#else
#define configPRIO_BITS 4
#endif

#define configLIBRARY_LOWEST_INTERRUPT_PRIORITY		 0x0f // config SysTick and PendSv interrupt priority
#define configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY 0x01 // config max interrupt priority of freeRTOS manager

/* This is the raw value as per the Cortex-M3 NVIC.  Values can be 255
(lowest) to 0 (1?) (highest). */
#define configKERNEL_INTERRUPT_PRIORITY (configLIBRARY_LOWEST_INTERRUPT_PRIORITY << (8 - configPRIO_BITS))
// #define configKERNEL_INTERRUPT_PRIORITY 		255
/* !!!! configMAX_SYSCALL_INTERRUPT_PRIORITY must not be set to zero !!!!
See http://www.FreeRTOS.org/RTOS-Cortex-M3-M4.html. */
#define configMAX_SYSCALL_INTERRUPT_PRIORITY (configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY << (8 - configPRIO_BITS))
// #define configMAX_SYSCALL_INTERRUPT_PRIORITY 	191 /* equivalent to 0xb0, or priority 11. */

/* This is the value being used as per the ST library which permits 16
priority values, 0 to 15.  This must correspond to the
configKERNEL_INTERRUPT_PRIORITY setting.  Here 15 corresponds to the lowest
NVIC value of 255. */
#define configLIBRARY_KERNEL_INTERRUPT_PRIORITY 15

/*-----------------------------------------------------------
 * UART configuration.
 *-----------------------------------------------------------*/
#define configCOM0_RX_BUFFER_LENGTH 128
#define configCOM0_TX_BUFFER_LENGTH 128
#define configCOM1_RX_BUFFER_LENGTH 128
#define configCOM1_TX_BUFFER_LENGTH 128

// add freeRTOS to stm32
#define vPortSVCHandler		SVC_Handler
#define xPortPendSVHandler	PendSV_Handler
#define xPortSysTickHandler SysTick_Handler

#endif /* FREERTOS_CONFIG_H */
